app/controllers/posts_controller.rb

  def new
    if params[:author_id] && Author.exists?(params[:author_id])
---
SELECT  1 AS one FROM "authors" LIMIT 1
SELECT "authors".* FROM "authors"

  def update
    @post = Post.find(params[:id])
    @post.update(post_params)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 7]]
UPDATE "posts" SET "title" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "123123"], ["updated_at", "2016-02-01 06:13:05.552201"], ["id", 7]]